# Итоговая контрольная работа по основному блоку
## Преобразование массива

_**Задача**_: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
_**Примеры**_:
[“Hello” “2” “world” “:-)”] → [“2”, “:-)”]  
[“1234” “1567” “-2” “computer science”] → [“-2”]  
[“Russia” “Denmark” “Kazan”] → []

## Решение

1. Вводим данные в виде строк, разделенных пробелами
2. Разбиваем строки на массив строк по пробелам
3. Для решения задачи используем 3 функции:

- Функция _CheckElements_ с входными параметрами *array* и *index* проверяет элементы массива на удовлетворение условию - длина строк меньше либо равна 3 - и возвращает значение типа bool "Истина" или "Ложь"
 ```csharp
bool CheckElements(string[] array, int index)

{

if (index < 0 || index >= array.Length)

return false;

return array[index].Length <= 3;

}
```

>[!Примечание]
>Условие if (index < 0 || index >= array.Length) проверяет находится ли индекс за пределами допустимого диапазона для массива

- Функция _CountElements_ с входными параметрами *array* вычисляет сумму элементов массива, удовлетворяющих условию задачи и возвращает значение типа int
```csharp
int CountElements(string [] array)

{

int total = 0;

for (int i = 0; i < array.Length; i++)

{

if (CheckElements(array, i) == true)

{

total++;

}

}

return total;

}
```

>[!TIP]
>Этот этап необходим для определения размера будущего массива

- Функция _newArray_ с входными параметрами *array* и *count* создает новый массив размера *count* со элементами массива, удовлетворяющих условию задачи и выводит его в консоль
```csharp
void newArray(string[] array, int count)

{

string[] newArray = new string[count];

count = 0;

for (int i = 0; i < array.Length; i++)

{

if (CheckElements(array, i) == true)

{

string temp = array[i];

newArray[count] = temp;

count++;

}

}

Console.WriteLine(String.Join(", ", newArray));

  

}
```

